app/views/books/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."book_id" = $1  [["book_id", 6]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."book_id" = $1  [["book_id", 11]]
---
			<div class="average-review-rating" data-score=<%= @average_review %>></div>
			<span class="number-of-reviews"> Based on <%=@book.reviews.count%> reviews 	</span>