app/controllers/books_controller.rb

	def show
		if @book.reviews.blank?
			 @average_review = 0
		else
			@average_review = @book.reviews.average(:rating).round(2)
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."book_id" = $1  [["book_id", 7]]
SELECT AVG("reviews"."rating") FROM "reviews" WHERE "reviews"."book_id" = $1  [["book_id", 7]]