app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("rating", "comment", "created_at", "updated_at", "user_id", "book_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["rating", 3], ["comment", "GOOD"], ["created_at", "2020-01-07 12:44:21.595673"], ["updated_at", "2020-01-07 12:44:21.595673"], ["user_id", 2], ["book_id", 10]]
---
	def create
		@review = Review.new(review_params)
		@review.book_id = @book.id
		@review.user_id = current_user.id

		if @review.save

UPDATE "reviews" SET "comment" = $1, "updated_at" = $2 WHERE "reviews"."id" = $3  [["comment", "nice bookkgkh"], ["updated_at", "2020-01-07 12:40:01.390268"], ["id", 1]]
---
	def update
		if @review.update(review_params)

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
		def find_book
			@book = Book.find(params[:book_id])

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
	def find_review
		@review = Review.find(params[:id])